{"pageProps":{"post":{"layout":"post","title":"Inspect the return value of a method in Visual Studio Debugger","description":"Check out this useful tip on how the inspect the return value of a method in Visual Studio Debugger","date":"2020-03-30 21:36:00 +0200","slug":"inspect-returned-value-with-vs-debugger","content":"\nThere is a neat functionality in Visual Studio that is quite helpful while debugging .Net applications. While the functionality itself has been around for a while, I am not sure that everyone working with Visual Studio is aware of it. It is possible to inspect the returned value of a method immediately after it has returned.\n\nSuppose you have a method like `Calc` in the following example. The result of the expression on line 10 is immediately returned. However, during debugging, you might want to inspect the return value before it is passed into another method on line 3.\n\n```c#\nstatic void Main(string[] args)\n{\n    SomeOtherCalc(Calc(1, 2));\n    var foo = \"\";\n    // ...\n}\n\nstatic int Calc(int a, int b)\n{\n    return a + b;\n}\n\nstatic void SomeOtherCalc(int c)\n{\n    // ...\n}\n```\n\nTraditionally, you could temporarily introduce a local variable `result`, store the computation and return `result` afterwards. However, that would require you to rebuild the project and introduce temporary unnecessary code.\n\n```\n// Possible, but we try to avoid that\nstatic int Calc(int a, int b)\n{\n    var result = a + b;\n    return result;\n}\n```\n\nInstead, you can add a breakpoint on your expression on line 10. Once hit, you \"Step Out\" of the method. This will place the debugger on the line, where the method has been called (line 3). Exactly at this point, you can now inspect the returned value either via the \"Immediate Window\" by typing `$ReturnValue` or via the \"Autos\" window, where the value will also be displayed.\n\n<figure>\n    <img src=\"/assets/images/returned_value.png\" alt=\"Inspect the returned value with Visual Studio Debugger\">\n    <figcaption class=\"c-caption\">Inspect the returned value with Visual Studio Debugger</figcaption>\n</figure>\n\nWith this useful functionality, you can inspect the return values of methods more easily without actually modifying the source code. Take note, that you won't be able to inspect the return value anymore as soon as you move the debugger forward.\n\n**Resources**\n\n* [How to see the value returned by a method in Visual Studio Debugger?](http://www.malgreve.net/2014/01/21/how-to-see-the-value-returned-by-a-method-in-visual-studio-debugger/)","url":"https://zlypher.github.io/posts/inspect-returned-value-with-vs-debugger"}},"__N_SSG":true}