{"pageProps":{"post":{"layout":"post","title":"Windows Service stuck in status \"Starting\"","description":"How to kill a Windows Service which is stuck in status \\\"Starting\\\"","date":"2018-02-19 22:30:00 +0200","slug":"windows-service-stuck-in-status-starting","content":"\nIf you develop in the .Net Ecosystem and have create a Windows Service, you might have come around this issue: One services doesn't work like it should. You want to restart it, but you discover, that it is stuck in either the state \"Starting\" or \"Stopping\". Unfortunately, all options are greyed out and you can neither start nor stop the service via the GUI.\n\nSo how can we resolve this issue and get the service back up and running? Fortunately, there is a solution which has been found long ago (see further links) and is not that hard to execute. All you need to do is find the process id (PID) of the offending service and kill it via the command line.\n\nFind out the PID of the service. Just make sure to use the actual service name and not the display name!\n\n```bash\n> sc queryex <SERVICE_NAME>\n```\n\nThis will output some information about the service, including the process id.\n\n```\nC:\\Users\\Thomas>sc queryex Foo.Services.Bar\n\nSERVICE_NAME: Foo.Services.Bar\n        TYPE               : 10  WIN32_OWN_PROCESS\n        STATE              : 2 0 START_PENDING\n                                (NOT_STOPPABLE, NOT_PAUSABLE, IGNORES_SHUTDOWN)\n        WIN32_EXIT_CODE    : 0  (0x0)\n        SERVICE_EXIT_CODE  : 0  (0x0)\n        CHECKPOINT         : 0x0\n        WAIT_HINT          : 0x0\n        PID                : 3976\n        FLAGS              :\n```\n\nKill the service. Make sure you have sufficient privileges to kill the service.\n\n```bash\n> taskkill /f /pid 3976\nSUCESS: The process with PID 3976 has been terminated.\n```\n\nThis will kill the service completely and you should be able to restart it again.\n\nRead up on this topic:\n* [How to recover from Windows service that is stuck in starting or stopped state](https://www.schneider-electric.com/en/faqs/FA239679/){:target=\"_blank\" rel=\"noopener noreferer\"}\n* [How to kill a windows service stuck on stopping or starting](http://support.minisoft.com/index.php/how-to-kill-a-windows-service-stuck-on-stopping-or-starting/){:target=\"_blank\" rel=\"noopener noreferer\"}","url":"https://zlypher.github.io/posts/windows-service-stuck-in-status-starting"}},"__N_SSG":true}