{"pageProps":{"post":{"layout":"post","title":"Filenames and Git on Windows","description":"Filename problems with Git on Windows","date":"2017-09-27 21:30:00 +0100","categories":"Git","slug":"filename-git-on-windows","content":"<p>Today I wanted to manually deploy a <a href=\"https://github.com/facebookincubator/create-react-app\">Create React App</a>{:target=\"_blank\" rel=\"noopener noreferrer\"} project to Github Pages. Now, normally this happens via Travis CI after each build, but this time I wanted to manually verify something. Luckily, this is pretty easy with CRA. If you installed the \"gh-pages\" packages and added the required script to package.json you only need to execute the deploy script and you are good to go.</p>\n<h2>The Problem</h2>\n<p>But this time, I ran into a rather strange problem:</p>\n<pre><code class=\"language-bash\">λ npm run deploy                                                                                                                   \n                                                                                                                                   \n> bool@1.0.0 predeploy E:\\projects\\bool                                                                                            \n> npm run build                                                                                                                    \n                                                                                                                                   \n                                                                                                                                   \n> bool@1.0.0 build E:\\projects\\bool                                                                                                \n> react-scripts build                                                                                                              \n                                                                                                                                   \nCreating an optimized production build...                                                                                          \nCompiled successfully.                                                                                                             \n                                                                                                                                   \nFile sizes after gzip:                                                                                                             \n                                                                                                                                   \n  50.73 KB  build\\static\\js\\main.54678454.js                                                                                       \n  658 B     build\\static\\css\\main.5c98f198.css                                                                                     \n                                                                                                                                   \nThe project was built assuming it is hosted at /bool/.                                                                             \nYou can control this with the homepage field in your package.json.                                                                 \n                                                                                                                                   \nThe build folder is ready to be deployed.                                                                                          \nTo publish it at https://zlypher.github.io/bool, run:                                                                              \n                                                                                                                                   \n  npm run deploy                                                                                                                   \n                                                                                                                                   \n                                                                                                                                   \n> bool@1.0.0 deploy E:\\projects\\bool                                                                                               \n> gh-pages -d build                                                                                                                \n                                                                                                                                   \nerror: unable to create file deployed at Mon Sep 25 18:25:02 UTC 2017 by Deployment Bot (from Travis CI): Invalid argument         \nfatal: Could not reset index file to revision 'origin/gh-pages'.                                                                   \n                                                                                                                                   \nnpm ERR! code ELIFECYCLE                                                                                                           \nnpm ERR! errno 1                                                                                                                   \nnpm ERR! bool@1.0.0 deploy: `gh-pages -d build`npm ERR! Exit status 1                                                              \nnpm ERR!                                                                                                                           \nnpm ERR! Failed at the bool@1.0.0 deploy script.                                                                                   \nnpm ERR! This is probably not a problem with npm. There is likely additional logging output above.                                 \n</code></pre>\n<p>If you read the log carefully, you will see that the script \"gh-pages -d build\" fails. Even \"git checkout gh-pages\" fails with the same error.</p>\n<p>Now if you've already used Travis CI to deploy th GH pages, you will be aware, that it creates a file with the timestamp of the deployment. In this example this files is conveniently named \"Mon Sep 25 18:25:02 UTC 2017 by Deployment Bot (from Travis CI)\".</p>\n<h2>The Solution</h2>\n<p>As it turns out, Windows really dislikes colons (\":\") in file names and prohibits them. So git can't create the file during checkout of the branch and fails with an \"Invalid argument\". In my case, manually deleting the file via github.com resolved the issue. Afterwards, the deployment script completed successfully.</p>\n","url":"https://zlypher.github.io/posts/filename-git-on-windows"}},"__N_SSG":true}