{"pageProps":{"post":{"layout":"post","title":"Help! My NodeList is not an Array","description":"NodeList are like arrays, but the are not arrays. So what to do?","date":"2020-04-04 22:48:00 +0200","slug":"help-my-nodelist-is-not-an-array","content":"<p>Let's say that you have to find a list of all links on a page. This is a fairly basic task and can be solved in different ways. For our purposes, using Vanilla JS, we could either use <code>document.getElementsByTagName</code> or <code>document.querySelectorAll</code>. While the former returns a <code>HTMLCollection</code>, the latter returns a <code>NodeList</code>. They are similar enough for our example, so we'll go with <code>querySelectorAll</code>. Our code will look something like this:</p>\n<pre><code class=\"language-js\">// let elements = document.getElementsByTagName(\"a\")\n// HTMLCollection(3) [a, a, a]\n\nlet elements = document.querySelectorAll(\"a\")\n// NodeList(3) [a, a, a]\n</code></pre>\n<p>That looks promising! As a next step, we want to get the <code>\"href\"</code> attribute from each link. So that we end up with a list of urls that page links to. Since we are well versed developers and want to use a functional approach, we use the <code>map</code> function. As a reminder, the map function will execute the callback for each element in the array and create a new array from the return values. Combined with arrow functions we get some concise, expressive code:</p>\n<pre><code class=\"language-js\">let links = elements.map(elem => elem.getAttribute(\"href\"));\n// Uncaught TypeError: document.querySelectorAll(...).map is not a function\n</code></pre>\n<p>However, that will result in a nasty TypeError. But why? Both the <code>NodeList</code> and the <code>HtmlCollection</code> look like arrays and can even access single items with <code>elements[index]</code>. As it turns out, there are <a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Iteration_protocols\">iterable objects</a> as well as \"array-like objects\". Array-like objects have a <code>length</code> property and can access elements via an index, but don't have all the methods, that natural arrays have. Which is precisely the case with <code>NodeList</code> and <code>HtmlCollection</code>.</p>\n<p>There are two quick and easy solutions (probably more, but those should be sufficient) to solve this problem:</p>\n<h2>Array.from</h2>\n<blockquote class=\"c-quote\" cite=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/from\">\"The Array.from() method creates a new, shallow-copied Array instance from an array-like or iterable object.\"</blockquote>\n<p><code>\"Array.from\"</code> is a new built-in function in ES6 (polyfills for IE are available), which can convert the <code>NodeList</code> and other objects into actual arrays. With that, we are now able to finally use the map function to implement our logic.</p>\n<pre><code class=\"language-js\">let elements = document.querySelectorAll(\"a\");\nlet links = Array.from(elements).map(elem => elem.getAttribute(\"href\"));\n</code></pre>\n<h2>Spread/Rest operator</h2>\n<p>The second solution utilizes the new spread and rest operators. By extracting the elements of a <code>NodeList</code> and immediately spreading it into a new array.</p>\n<pre><code class=\"language-js\">let elements = document.querySelectorAll(\"a\");\nlet links = [...elements].map(elem => elem.getAttribute(\"href\"));\n</code></pre>\n<h2>Conclusion</h2>\n<p>Both solutions work fine for that example. The main take away is, that you should be aware that not everything that looks like an array at first glance, really can be used in all situations like an array. However, additions with ES6 like the spread operator make dealing with arrays (and objects) easier and more comfortable.</p>\n<p><strong>Resources</strong></p>\n<ul>\n<li><a href=\"https://developer.mozilla.org/de/docs/Web/API/Document/querySelectorAll\">querySelectorAll MDN</a></li>\n<li><a href=\"https://developer.mozilla.org/de/docs/Web/API/NodeList\">NodeList</a></li>\n<li><a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/from\">Array.from</a></li>\n<li><a href=\"https://developer.mozilla.org/de/docs/Web/JavaScript/Reference/Operators/Spread_operator\">Spread Operator</a></li>\n</ul>\n","url":"https://zlypher.github.io/posts/help-my-nodelist-is-not-an-array"}},"__N_SSG":true}