{"pageProps":{"post":{"layout":"post","title":"Social Share Links","date":"2018-01-15 15:32:00 +0200","slug":"social-share-links","content":"<h2>The Problem</h2>\n<p>Quite a few pages need social share links nowadays. Product pages, blog posts, news articles, ... They are basically everywhere. There are quite a lot of libraries and plugins available which provide the desired functionality. However, they often rely on additional JavaScript being loaded and come with a lot of unnecessary stuff.</p>\n<p>But don't forget! Most of them are ordinary links, which don't require anything except a link tag. So how can you add the most common social share links to your page?</p>\n<h2>Social Links</h2>\n<p><strong>Facebook</strong></p>\n<p>Facebook is probably one of the most popular social networks. Unfortunately, you can only share a URL, but you can't prefill the text to comment. Therefore, the share link is rather straight forward:</p>\n<p><code>https://www.facebook.com/sharer/sharer.php?u=[SHARE URL]</code></p>\n<p>Just remember, that <code>[SHARE URL]</code> has to be a valid URL, or the link won't work.</p>\n<p><strong>Twitter</strong></p>\n<p>Next on the list is twitter. By specifying the <code>[SHARE TEXT]</code> it is possible the prefill the tweet with any textual content you like:</p>\n<p><code>https://twitter.com/intent/tweet/?text=[SHARE TEXT]</code>\n<code>https://twitter.com/home?status=[SHARE TEXT]</code> (works as well)</p>\n<p><strong>Whats App</strong></p>\n<p>To enable sharing via WhatsApp, one can use the following link. For WhatsApp it is possible to specify content, which will be prefilled. If the user has WhatsApp installed, this link will open the App and ask to select a contact to send the message to.</p>\n<p><code>whatsapp://send?text=[SHARE TEXT]</code></p>\n<p>This share link only makes sense on mobile (maybe tablet as well) devices. So be sure to include appropriate checks, or your users might get confused.</p>\n<p><strong>E-Mail</strong></p>\n<p>E-Mail is the next one on the list. Old, but still used to share links and information. Just as you might have imagined, you can specify a receiver email adress, a subject and the content of the email:</p>\n<p><code>mailto:[TO EMAIL]?subject=[SHARE TITLE]&#x26;body=[SHARE TEXT]</code></p>\n<p>The <code>[TO EMAIL]</code> part is completely optional. If it is not specified, the email agent will prepare the email with the given subject and body.</p>\n<p><strong>SMS</strong></p>\n<p>SMS share links are a bit special. Different behaviour on Android and iOS. You don't actually have to set a [PHONE NUMBER]. If you leave it blank the user will be able to select a recipient. The message will be prefilled with the given text.</p>\n<p><code>sms:[PHONE NUMBER]?body=[SHARE TEXT]</code></p>\n<p><em>(This link will only work on Android though. See Update for further details)</em></p>\n<h2>Others</h2>\n<p>There are a lot of other social networks and ways to share content. But don't worry, there are a lot of resources available online, where you can <a href=\"http://www.sharelinkgenerator.com/\">generate social</a>{:target=\"_blank\" rel=\"noopener noreferer\"} <a href=\"https://sharingbuttons.io/\">share links</a>{:target=\"_blank\" rel=\"noopener noreferer\"} or check the <a href=\"https://github.com/bradvin/social-share-urls\">share urls</a>{:target=\"_blank\" rel=\"noopener noreferer\"}.</p>\n<h2>Conclusion</h2>\n<p>To sum up, it is very easy to get started and integrate social share links into your website.</p>\n<section class=\"c-mind\" markdown=\"1\">\n**Keep in Mind:** Don't forget to URL encode the text content you want to share with these links.\n</section>\n<p>Read up on this topic:</p>\n<ul>\n<li><a href=\"https://stackoverflow.com/a/19126326/733368\">StackOverflow answer regarding SMS share link</a>{:target=\"_blank\" rel=\"noopener noreferer\"}</li>\n</ul>\n<section class=\"c-update\" markdown=\"1\">\n**Update 2018-01-18:**\n<p>It appears, that iOS handles the SMS share links differently than Android. Android accepts a link format like <code>sms:[PHONE NO]?body=[TEXT CONTENT]</code>. However, this will fail on iOS. Instead you have to use <code>sms:[PHONE NO];body=[TEXT CONTENT]</code> for old iOS versions and <code>sms:[PHONE NO]&#x26;body=[TEXT CONTENT]</code> for iOS 8 and above. Take note of the delimiter in front of the body parameter!</p>\n<p>Check out <a href=\"https://stackoverflow.com/q/6480462/733368\">How to pre-populate the sms body text via an html link</a>{:target=\"_blank\" rel=\"noopener noreferer\"} via StackOverflow.</p>\n</section>\n","url":"https://zlypher.github.io/posts/social-share-links"}},"__N_SSG":true}