{"pageProps":{"post":{"layout":"post","title":"Umbraco: Layers of Caching","description":"How to make sense of caching in Umbraco","date":"2018-11-21 20:00:00 +0100","slug":"umbraco-layers-of-caching","content":"<p><a href=\"https://umbraco.com/products/umbraco-cms/\">Umbraco</a> is a widely used ASP.NET CMS. If you worked with Umbraco for some time, you might have noticed, that there are various layers of caching and it can be confusing where data is stored.</p>\n<p>So Umbraco has four layers, where data is stored or cached:</p>\n<ol>\n<li>Database table <code>[dbo].[cmsPropertyData]</code></li>\n<li>Database table <code>[dbo].[cmsContentXml]</code></li>\n<li>XML file <code>App_Data/umbraco.config</code></li>\n<li>In-Memory cache</li>\n</ol>\n<h2>cmsPropertyData</h2>\n<p>The <code>[dbo].[cmsPropertyData]</code> table resides in the umbraco database. It holds all data stored in the properties of all your nodes. Take note, that all previous versions are stored as well. So if you change something in the backend, it will be reflected in this table. However, this table is not actually used for the frontend. You want to take a look at <code>[dbo].[cmsContentXml]</code> for that.</p>\n<h2>cmsContentXml</h2>\n<p>Once you publish a node, Umbraco gathers all the information for this node, and stores it as a XML structure in the <code>[dbo].[cmsContentXml]</code> table. So you will have on entry per node with its node id and all of its data. This might be the source for the data in your application, but it also might be the <code>umbraco.config</code>.</p>\n<h2>umbraco.config</h2>\n<p>The <code>umbraco.config</code> is basically the same as the <code>[dbo].[cmsContentXml]</code> but stored as a file on disk. By default, this file is created and used to reduce the load on the database. However, this can be disabled via a <code>Web.config</code> entry.</p>\n<h2>Conclusion</h2>\n<p>So this was a short introduction of the different layers of Umbraco. You might not encounter it in your day to day work, but if you need to change something directly in the database, it might be good to have an idea where the data might be cached.</p>\n<p><strong>Resources</strong></p>\n<ul>\n<li><a href=\"https://umbraco.com/products/umbraco-cms/\">Umbraco CMS</a></li>\n<li><a href=\"https://github.com/umbraco/Umbraco-CMS\">Umbraco CMS - GitHub Repository</a></li>\n</ul>\n","url":"https://zlypher.github.io/posts/umbraco-layers-of-caching"}},"__N_SSG":true}