{"pageProps":{"post":{"layout":"post","title":"Advent of Code 2019","description":"Checkout Advent of Code, an Advent calendar of small programming puzzles","date":"2019-12-05 19:10:00 +0100","slug":"advent-of-code-2019","content":"\nChristmas time is here. Work is going slow. There is not a lot of stuff to do. If that applies to you and you enjoy a programming challenge, then I have news for you! Check out this years version of [Advent of Code](https://adventofcode.com/)! Each day a new puzzle will be published with two parts. You can earn stars for each completed puzzle and even compete on a leaderboard (the first 100 solutions receive more stars).\n\nThe author, [Eric Wastl](http://was.tl/), puts in a lot of effort into Advent of Code each year. So show him some love and spread the word!\n\n<blockquote class=\"c-quote\" cite=\"https://adventofcode.com/2019/about\">\nAdvent of Code is an Advent calendar of small programming puzzles for a variety of skill sets and skill levels that can be solved in any programming language you like. People use them as a speed contest, interview prep, company training, university coursework, practice problems, or to challenge each other.\n<small class=\"c-quote__source\">https://adventofcode.com/2019/about</small>\n</blockquote>\n\nI will also join in on the fun and publish my solutions on GitHub at [zlypher/advent-of-code](https://github.com/zlypher/advent-of-code). However, I am already a few days behind, so don't count on it being completely up to date.\n\nIf you are stuck or simply want to exchange some thoughts and solutions with other people, I encourage you to check out the [Advent of Code on Reddit](https://www.reddit.com/r/adventofcode/). Don't be intimidated though, there are some impressive solutions posted.\n\n**Resources**\n* [Advent of Code](https://adventofcode.com/)\n* [Eric Wastl](http://was.tl/)\n* [Advent of Code on Reddit](https://www.reddit.com/r/adventofcode/)","url":"https://www.tompka.io/posts/advent-of-code-2019"}},"__N_SSG":true}