{"pageProps":{"post":{"layout":"post","title":"Easier Web Development with Emmet","description":"Emmet — the essential toolkit for web-developers","date":"2018-06-15 21:58:00 +0100","slug":"easier-web-development-with-emmet","content":"<p>If you are a web developer or often find yourself writing lots of HTML, XML, JSX and CSS, then this post is for you! Today I'd like to introduce you to a very useful tool for writing lot's of boilerplate HTML: <a href=\"https://emmet.io/\">Emmet</a>{:target=\"_blank\" rel=\"noopener noreferer\"}</p>\n<p>Probably almost everyone feels the same way... writing lots of HTML or CSS is rather boring, repetetive and error prone. Some editors automatically close html tags, but that's mostly it. This is where Emmet comes into play. It defines a css like syntax which expands to actual valid HTML structure or CSS properties.</p>\n<p>So let's not waste any time and give you an example. The following abbreviation demonstrates the basic features of Emmet.</p>\n<pre><code>section>.hello>p{World}\n</code></pre>\n<p>This snippet will expand to the following HTML structure:</p>\n<pre><code>&#x3C;section>\n    &#x3C;div class=\"hello\">\n        &#x3C;p>World&#x3C;/p>\n    &#x3C;/div>\n&#x3C;/section>\n</code></pre>\n<p>Pretty neat, huh? If you have ever written some css, the snippet should be pretty self explanatory. You can create children with <code>></code>, names prefixed with a <code>.</code> will add a class to the element and <code>{}</code> let's you specify some actual text content. Everything that is not recognized as a special snippet will be rendered as a tag name. Check out the <a href=\"https://docs.emmet.io/cheat-sheet/\">Emmet Cheat Sheet</a>{:target=\"_blank\" rel=\"noopener noreferer\"} for lot's of different possibilites to use and combine different snippets!</p>\n<p>One more neat trick combines multiplication with item numbering. So if you want to create a list with 5 elements, numbered from 1 to 5, this would be trivial with emmet:</p>\n<pre><code>ul>li*5{$}\n</code></pre>\n<p>And zack, it will output:</p>\n<pre><code>&#x3C;ul>\n    &#x3C;li>1&#x3C;/li>\n    &#x3C;li>2&#x3C;/li>\n    &#x3C;li>3&#x3C;/li>\n    &#x3C;li>4&#x3C;/li>\n    &#x3C;li>5&#x3C;/li>\n&#x3C;/ul>\n</code></pre>\n<p>That is so sweet and will reduce the time to write stuff like that quite a bit! And another great thing: Emmet works for JSX as well! So don't worry about the <code>class</code> attributes. If you are inside a JSX context, Emmet will automatically create <code>className</code> isntead. Oh, and there is also a resolver for CSS snippets. So you can quickly specify properties without having to type out the whole line. See some nifty examples below:</p>\n<pre><code>.test {\n    /* pos:r */\n    position: relative;\n    /* d:f */\n    display: flex;\n    /* pt40px */\n    padding-top: 40px;\n    /* ml2e */\n    margin-left: 2em;\n}\n\n/* @m */\n@media screen {\n    \n}\n</code></pre>\n<p>There are tons of different options for almost all css properties available (even helpers to automatically create browser prefixes). So definitely checkout the docs from emmet, which are really comprehensive.</p>\n<p>If you are wondering how to actually use it, don't worry... most of the modern text editors and IDEs have extensions for Emmet readily available or even built in (VSCode!). <a href=\"https://emmet.io/download/\">Browse through the download section of Emmet</a>{:target=\"_blank\" rel=\"noopener noreferer\"}, if you are not sure about your editor. Even online services like CodePen or JSFiddle support emmet abbrviations out of the box.</p>\n<p>It might take a bit to get used to it, but it will definitely speed up your development process in the long run. Give it a try and spread the word if you found it useful!</p>\n<p>Check out Emmet here:</p>\n<ul>\n<li><a href=\"https://emmet.io/\">Emmet Website</a>{:target=\"_blank\" rel=\"noopener noreferer\"}</li>\n<li><a href=\"https://github.com/emmetio\">Emmet GitHub</a>{:target=\"_blank\" rel=\"noopener noreferer\"}</li>\n<li><a href=\"https://docs.emmet.io/cheat-sheet/\">Emmet Cheat Sheet</a>{:target=\"_blank\" rel=\"noopener noreferer\"}</li>\n</ul>\n","url":"https://zlypher.github.io/posts/easier-web-development-with-emmet"}},"__N_SSG":true}