{"pageProps":{"post":{"layout":"post","title":"COM Exception with IISNode and node-export-server","description":"Find out where these SetProcessDpiAwareness exception in node-export-server are coming from","date":"2018-11-29 12:46:00 +0100","slug":"com-exception-with-iisnode-and-node-export-server","content":"<h2>The Problem</h2>\n<p>For our web application, we use Highcharts to render beautiful charts. Some charts are reused multiple times across the website, so we decided to prerender them via <a href=\"https://github.com/highcharts/node-export-server\">highcharts/node-export-server</a>. Due to operational reasons, it is hosted inside a Windows Service via <a href=\"https://github.com/Azure/iisnode\">Azure/iisnode</a>. This process works reasonably well. However, we noticed, that there are errors logged, although the charts seem to be rendered just fine:</p>\n<pre><code>[error] phantom worker 2 error - SetProcessDpiAwareness failed: \"COM error 0x80070005  (Unknown error 0x0ffffffff80070005)\"\n</code></pre>\n<h2>Investigation of the Error</h2>\n<p>Naturally, we wanted to find the cause of this error, if there are some issues we should be aware of and if there is anything we could do to avoid it.</p>\n<p>A quick search reveals, that there are quite some GitHub repositories, that experience similar issues. In the end, most of them refer to an issue in PhantomJS. The most prominent discussion is in the <a href=\"https://github.com/ariya/phantomjs/issues/14095\">issue #14095</a>. If you don't know: \"PhantomJS (phantomjs.org) is a headless WebKit scriptable with JavaScript.\" (from Phantom JS README). Incidentally, it is used by the Highcharts Node.js Export Server to render the charts. And unfortunately, this issue occurs, if PhantomJS is run from a service in Windows. Which happens to be just what we are doing.</p>\n<h2>Resolving the Error</h2>\n<h3>Pass flag to PhantomJS</h3>\n<p>However, there seems to be a way around this issue. According the issue, it is possible to pass <code>-platform windows:dpiawareness=0</code> to PhantomJS. So can we actually configure this, since the phantomjs process is spawned by the node-export-server? The actual call happens in <code>phantompool.js</code>:</p>\n<pre><code>// https://github.com/highcharts/node-export-server/blob/2.0.16/lib/phantompool.js\nworker.process = phantomjs.exec(settings.worker, (__dirname + '/../'));\n</code></pre>\n<p>There is no way to configure additional options, so we are out of luck here.</p>\n<h3>Windows Registry</h3>\n<p>There seems to be some additional way to work around this issue via the Windows Registry or Windows Policies, but I wasn't able to find out the specifics. If you have more luck on this front, please let me know.</p>\n<h3>Fork node-export-server</h3>\n<p>Another possibility would be to fork the node-export-server repository on GitHub and implement the desired functionality. However, this would cause additional overhead and it seems unlikely, that this would be merged back into the main repository. Since it seems that the engineers from Highcharts are thinking about moving to a different headless browser like Chrome (with its rather new headless mode). However, there doesn't seem to be a clear path or timeline yet. Follow the <a href=\"https://github.com/highcharts/node-export-server/issues/57\">issue #57 on GitHub</a> for further updates.</p>\n<h2>Result</h2>\n<p>In the end, we decided to live with these errors for now, as there doesn't seem to be any problem with the chart generation itself. Workarounds would require further development and testing resources which are currently not available.</p>\n<p><strong>Resources</strong></p>\n<ul>\n<li><a href=\"https://github.com/highcharts/node-export-server\">node-export-server Repository</a></li>\n<li><a href=\"https://github.com/Azure/iisnode\">iisnode Repository</a></li>\n<li><a href=\"https://github.com/ariya/phantomjs\">PhantomJS Repository</a></li>\n</ul>\n","url":"https://zlypher.github.io/posts/com-exception-with-iisnode-and-node-export-server"}},"__N_SSG":true}